import re

donations = """#接龙
2024年重修先锋庙及境主公庙捐资接龙

1. 钟其发：先锋庙1388元，境主公庙1388元
2. 钟胜：先锋庙668元，境主公庙668元
3. 外嫁姑姐钟敏慧：先锋庙268元，境主公庙268元
4. 外嫁姑姐钟春桃：先锋庙268元，境主公庙268元
5. 钟光：先锋庙888元，境主公庙888元
6. 钟如强：先锋庙288元，境主公庙288元
7. 蛙场老板（上坝）钟如胜：先锋庙688元，境主公庙688元
8. 钟其意：先锋庙688元，境主公庙688元
9. 钟其丰：先锋庙638元，境主公庙638元
10. 钟如辉：先锋庙288元，境主公庙288元
11. 钟德强：先锋庙666元，境主公庙666元
12. 钟其平:先锋庙300元，境主公庙300元
13. 钟贯：先锋庙988元，境主公庙988元
14. 外嫁姑姐钟水婷：先锋庙200元，境主公庙200元
15. 外嫁姑姐钟慧敏：先锋庙1188元，境主公庙1188元
16. 外嫁姑姐钟慧舒：先锋庙388元，境主公庙388元
17. 钟其才：先锋庙688元，境主公庙688元
18. 钟其佳：先锋庙688元，境主公庙688元
19. 外嫁姑姐钟如梅：先锋庙388元，境主公庙388元
20. 钟志：先锋庙638元，境主公庙638元
21. 钟其润：先锋庙638元，境主公庙638元
22. 钟其登：先锋庙618元，境主公庙618元
23. 钟其璋：先锋庙638元，境主公庙638元
24. 钟其铿：先锋庙666元，境主公庙666元
25. 外嫁姑姐钟玉霞：先锋庙238元，境主公庙238元
26. 外嫁姑姐钟玉雲：先锋庙238元，境主公庙238元
27. 外嫁姑姐钟德英：先锋庙998元，境主公庙998元
28. 钟虎：先锋庙688元，境主公庙688元
29. 钟见：先锋庙898元，境主公庙898元
30. 钟其庚：先锋庙668元，境主公庙668元
31. 钟其广：先锋庙889元，境主公庙889元
32. 钟槐：先锋庙200元，境主公庙200元
33. 鱼塘老板庞富志：先锋庙250元，境主公庙250元
34. 钟其军：先锋庙698元，境主公庙698元
35. 钟其旺：先锋庙688元，境主公庙688元
36. 钟其志：先锋庙668元，境主公庙668元
37. 外嫁姑姐钟小清：先锋庙288元，境主公庙288元
38. 外嫁姑姐钟小珍：先锋庙238元，境主公庙238元
39. 外嫁姑姐钟红燕：先锋庙288元，境主公庙288元
40. 外嫁姑姐钟水清：先锋庙218元，境主公庙218元
41. 外嫁姑姐（缪志芳干女儿）黄桂玲：先锋庙238元，境主公庙238元
42. 钟其汉：先锋庙688元，境主公庙688元
43. 钟程：先锋庙688元，境主公庙688元
44. 外嫁姑姐钟小翠：先锋庙288元，境主公庙288元
45. 钟琼:先锋庙888元，境主公庙888元
46. 外嫁姑姐钟美娟：先锋庙200元，境主公庙200元
47. 钟其建：先锋庙638元，境主公庙638元
48. 钟清：先锋庙668元，境主公庙668元
49. 上坝村钟晓燕：先锋庙200元，境主公庙200元
50. 外嫁姑姐钟桂兰：先锋公庙238元，境主公庙238元
51. 钟进成：先锋庙688元，境主公庙688元
52. 钟其旭：先锋庙638元，境主公庙638元
53. 钟其居：先锋庙638元，境主公庙638元
54. 外嫁姑姐钟其秀：先锋庙300元，境主公庙300元
55. 钟其南：先锋庙888元，境主公庙888元
56. 钟其标：先锋庙618元，境主公庙618元
57. 外嫁姑姐钟华英：先锋庙638元，境主公庙638元
58. 钟其进：先锋庙688元，境主公庙688元
59. 钟运：先锋庙618元，境主公庙618元
60. 钟德杰：先锋庙698元，境主公庙698元
61. 外嫁姑姐钟小妹：先锋庙638元，境主公庙638元
62. 外嫁姑姐钟辉英：先锋庙100元，境主公庙100元
63. 钟发：先锋庙688元，境主公庙688元
64. 外嫁姑姐钟伟英：先锋庙300元，境主公庙300元
65. 外嫁姑姐钟美玲:先锋庙288元，境主公庙288元
66. 外嫁姑姐钟小芬:先锋庙300元，境主公庙300元
67. 钟意:先锋庙1500元，境主公庙1500元
68. 钟其文：捐先锋公庙1688.89元，境主公庙1688.89元
69. 钟其裕：先锋庙618元，境主公庙618元
70. 钟强：先锋庙688元，境主公庙680元
71. 钟力：先锋庙668元，境主公庙668元
72. 外嫁姑姐钟梅娟：先锋庙218元，境主公庙218元
73. 外嫁姑姐钟梅金：先锋庙338元，境主公庙338元
74. 外嫁姑姐钟大妹：先锋庙218元，境主公庙218元
75. 外嫁姑姐钟春丽：先锋庙218元，境主公庙218元
76. 外嫁姑姐钟其连：先锋庙238元，境主公庙238元
77. 钟德平：先锋公庙668元，境主公庙668元
78. 钟汉：先锋公庙638元，境主公庙638元"""

先锋庙总额 = 0
境主公庙总额 = 0

# 使用正则匹配先锋庙元或者先锋公庙元里面的金额
先锋庙金额 = re.findall(r'先锋.*?(\d+(?:\.\d+)?)元', donations)
print(len(先锋庙金额))
print(先锋庙金额)
先峰庙总额 = sum(float(x) for x in 先锋庙金额)
print(先峰庙总额)

境主公庙金额 = re.findall(r'境主.*?(\d+(?:\.\d+)?)元', donations)
print(len(境主公庙金额))
print(境主公庙金额)
境主公庙总额 = sum(float(x) for x in 境主公庙金额)
print(境主公庙总额)

print(1388 + 668 + 268 + 268 + 888 + 288 + 688 + 688 + 638 + 288 + 666 + 300 + 988 + 200 + 1188 + 388 + 688 + 688 + 388 + 638 + 638 + 618 + 638 + 666 + 238 + 238 + 998 + 688 + 898 + 668 + 889 + 200 + 250 + 698 + 688 + 668 + 288 + 238 + 288 + 218 + 238 + 688 + 688 + 288 + 888 + 200 + 638 + 668 + 200 + 238 + 688 + 638 + 638 + 300 + 888 + 618 + 638 + 688 + 618 + 698 + 638 + 100 + 688 + 300 + 288 + 300 + 1500 + 1688.89 + 618 + 680 + 668 + 218 + 338 + 218 + 218 + 238 + 668 + 638
)


with open('D://work/online-notes/test_pay.yaml', 'r',encoding='utf-8') as file:
    print(file.readline())
    print(file.readline())
    print(file.readline())
    print(file.readline())
    print(file.readline())